Repository: OS2World/APP-GRAPHICS-HPGS
Catalog: src/po/hpgs_*.po
Languages: de

source: hpgs v%s - HPGl Script, a hpgl/2 interpreter/renderer. (C) 2004-2009 ev-i Informationstechnologie GmbH (http://www.ev-i.at) published under the LGPL (http://www.fsf.org/licenses/lgpl.html). usage: hpgs [-i] [-v] [-q] [-d <dev>] [options...] [-o <out>] <in1> <in2>... -i ... Ignore plotsize from PS and determine the plotsize from the file content. --linewidth-size ... Account for linewidths in the plotsize calculation for -i (default behaviour). --no-linewidth-size ... Ignore linewidths in the plotsize calculation for -i. -v ... Increase verbosity. -q ... Decrease verbosity, be quiet. -o <out> ... specifiy the output filename. If not specified, write to stdout. -m ... Switch to multipage mode, if a single file is given on the. command line. If not specified, only the first page of the input file is processed. -w ... Correct linewidth by given factor (default: 1). -d ... Specifiy the output device. The default is the native 'eps' device, which writes a simple eps file. See section `Supported devices' below. -a ... Use antialiasing when rendering to a png image. --thin-alpha=<a> Specifiy the minimal alpha value for thin lines. allowed values lie in the interval [0.001,1.0] (default: 0.25). -I ... Specifiy image interpolation. --rop3 ... Use ROP3 raster operations for rendering on devices with ROP3 capabilities (default). --no-rop3 ... Suppress usage of ROP3 raster operations. -c ... Specifiy the compression level for png writing. -r ... Specifiy the device resolution in dpi. If no y-resolution is given, the y-resolution is set to the same value as the x-resolution. -p ... Specifiy the maximum pixel size of the device. This is in fact an alternate method to specify the resolution of the device. If -p is given, the device resolution is caclulated in a way, that the plot fits into the given rectangle. If no y-size is given, the size y-size is set to the same value as the x-size. -s<papersize> ... Specifiy the plot size in pt (1/72 inch). If -s is not given, the size is calculated from the contents of the hpgl file. The <papersize> may be either one of the standard paper sizes A0,A1,A2,A3 or A4, their landscape versions A0l,A1l,A2l,A3l or A4l or a size in the format <width>x<height> where <width> and <height> specify a physical length in one of the formats <l>,<l>mm,<l>cm,<l>inch or <l>pt. <l> is a floating point number, the default unit is PostScript pt (1/72 inch). --origin=<origin> ... Specifiy the origin of the displayed content. If -s is not given, the origin is calculated from the contents of the hpgl file. The <origin> may be in the format <width>x<height> as described above for the option -s. --paper=<papersize> Specify a paper size of the output device. All plots are scaled to this paper size respecting the given border. If no fixed paper size is given, each page in the output file has an individual size adapted to the size of the HPGL content of the page. The format of <papersize> is decribed above for -s. --border=<border> Specify a border for placing plots on output pages. --rotation=<angle> Specify an angle for placing plots on output pages. --stamp=<stamp> Specify a string, which is printed in the background. --stamp-encoding=<enc> Specify an the name of the encoding of the string, which is given in --stamp. Default is iso-8859-1. --stamp-size=<pt> Specify the size of the stamp specified with --stamp in point. Default value: 500pt. --dump-png=<filename> Specify a filename for dumping inline PCL images in. PNG format. The actual filenames written are: <filename>0001.png <filename>0002.png ..... If <filename> contains an extension '.png' the counter is put between the basename and the '.png' extension. --help Displays this usage information. --version Displays the version information. Supported devices (option -d): bbox ... writes a PostScript BoundingBox to stdout. ps ... writes a multipage PostScript file. eps ... writes an eps files. png_256 ... writes an indexed 8bpp png image. png_gray... writes a grayscale 8bpp png image. png_rgb ... writes a rgb 24bpp png image. png_gray_alpha ... writes a grayscale 16bpp png image with an alpha channel. png_rgb_alpha ... writes a rgb 32bpp png image with an alpha channel. cairo_png ... writes a rgb 32bpp png image using the cairo library (experimental).
de: hpgs v%s - HPGl Script, ein hpgl/2 Interpreter/Renderer. (C) 2004-2009 ev-i Informationstechnologie GmbH (http://www.ev-i.at) veröffentlicht unter der LGPL (http://www.fsf.org/licenses/lgpl.html). Verwendung: hpgs [-i] [-v] [-q] [-d <dev>] [options...] [-o <out>] <in1> <in2>... -i ... Die HPGL-Plotgröße ignorieren und stattdessen die Plotgröße aus dem Dateiinhalt bestimmen. --linewidth-size ... Strichstärke in die Größenberechnung der Option -i einbeziehen (Standardverhalten). --no-linewidth-size ... Bei der Größenberechnung mit -i die Strichstärke ignorieren. -v ... Mehr Diagnosemeldungen ausgeben. -q ... Weniger Diagnosemeldungen ausgeben, Stillschweigen. -o <out> ... Dateinamen der Ausgabe angeben. Ansonsten wird auf die Standardausgabe geschrieben. -m ... Mehrseitigen Modus anschalten, wenn nur eine Eingabedatei. angegeben wurde. Ansonsten wird nur die erste Seite ausgegeben. -w ... Korrekturfaktor für Strichstärken (Standard: 1). -d ... Den Ausgabetreiber angeben. Standard ist der eingebaute 'eps'-Treiber, der eine einfache eps-Datei schreibt. Beachten Sie den Abschnitt `Unterstützte Treiber' im Anschluss. -a ... Antialiasing (Kantenglättung) des PNG-Renderers einschalten. --thin-alpha=<a> Den minimalen Alpha-Wert für dünne Linien angeben. Wertebereich: [0.001,1.0] (Standard: 0.25). -I ... Dargestellte Pixelbilder werden geglättet (interpoliert). --rop3 ... ROP3 Rasteroperationen verwenden, soferene diese von der Ausgabeeinheit unterstützt sind. (Standard). --no-rop3 ... ROP3 Rasteroperationen ausschalten. -c ... Kompressionsgrad für die PNG-Bildausgabe angeben. -r ... Angabe der Auflösung in dpi. Wenn keine y-Auflösung angegeben wird, wird die eine angegebene Auflösung für x und y verwendet. -p ... Angabe der maximalen Pixelgröße des ausgegebenen Bilds. Dies ist eigentlich eine alternative Methode, um die Auflösung anzugeben. Wenn -p angegeben wird, dann die Auflösung so bestimmt, dass das Pixelbild die angegebene Pixelgröße gereade nicht überschreitet. Wenn keine y-Größe angegeben wird, wird die eine angegebene Größe für x und y verwendet. -s<papersize> ... Angabe der Plotgröße in pt (1/72 inch). Wenn -s nicht angegeben ist, wird die Plotgröße aus dem Inhalt der HPGL-Datei bestimmt. <papersize> kann entweder eine der Standardpapiergrößen A0,A1,A2,A3 or A4, eine Querformatversion A0l,A1l,A2l,A3l or A4l derselben oder ein Größe der Form <width>x<height> sein. Dabei sind <width> und <height> seine physikalische Länge bzw. Höhe im Format <l>,<l>mm,<l>cm,<l>inch or <l>pt. <l> ist dabei ein Fließkommazahl. Die Standardeinheit ist ein PostScript pt (1/72 inch). --origin=<origin> ... Angabe des Ursprungs des dargestellten Inhalts. Wenn --origin nicht angegeben wird, berechnet sich der Ursprung aus dem Inhalt der HPGL Datei. <origin> wird im Format <width>x<height> analog zum Argument zu -s angegeben. --paper=<papersize> Angabe der Zielpapiergröße der Ausgabedatei. Alle Daten werden so skaliert, dass diese inklusive der benutzerdefinierten Ränder auf diese Seitegröße passen. Wenn --paper nicht angegeben wird, hat jede ausgegebene. Seite Ihre individuelle Größe, welche sich aus dem HPGL- Inhalt ergibt. Das format von <papersize> wird unter -s beschrieben. --border=<border> Angabe des Randes für die Platzierung der Inhalts auf einer Seite. --rotation=<angle> Angabe des Rotationswinkels für die Platzierung der Inhalts auf einer --stamp=<stamp> Einen Wasserzeichen-String angeben. --stamp-encoding=<enc> Zeichensatzcodierung des Wasserzeichen-Strings angeben Standard ist iso-8859-1. --stamp-size=<pt> Die Ausgabegröße des Wasserzeichens in pt angeben. Standardwert: 500pt. --dump-png=<filename> Dateiname für die Ausgabe von eingebetteten PCL-Pixelbildern im PNG-Format. The geschriebenen Dateien heißen: <filename>0001.png <filename>0002.png ..... Wenn <filename> die Endung'.png' enthält, wird die fortlaufende Nummer vor der Dateiendung eingefügt. --help Diese Information anzeigen. --version Eine kurze Versionsinformation anzeigen. Unterstützte Treiber (option -d): bbox ... schreibt eine PostScript BoundingBox auf die Standardausgabe. ps ... schreibt eine mehrseitige PostScript-Datei. eps ... schreibt eine eps-Datei. png_256 ... schreibt ein indiziertes 8bpp png-Pixelbild. png_gray... schreibt ein 8bpp png-Pixelbild in Graustufen. png_rgb ... schreibt ein 24bpp png-Pixelbild in Farbe. png_gray_alpha ... schreibt ein 16bpp png-Pixelbild mit Alpha-Kanal. png_rgb_alpha ... schreibt ein 32bpp png-Pixelbild in Farbe mit Alpha-Kanal. cairo_png ... schreibt ein 32bpp png-Pixelbild mit Hilfe der cairo-Bibliothek (experimentell).

source: Error getting installation path: %s.
de: Fehler beim Bestimmen des Installationspfades: %s.

source: Error: Device options specified before -d argument.
de: Fehler: Treiberspezifische Optionen wurden vor den Argument -d angegeben.

source: Error: --stamp-size= must be followed by a valid length.
de: Fehler: --stamp-size= muss von einer gültigen Längenangabe gefolgt werden.

source: Error: stamp-size must lie in the interval [20,2000]pt.
de: Fehler: stamp-size muss im Intervall [20,2000]pt liegen.

source: Error: -I must be followed by an integer number.
de: Fehler -I muss von einer Ganzzahl gefolgt werden.

source: Error: The argument to -I must be 0 or 1.
de: Fehler: Das Argument für -I muss 0 oder 1 sein.

source: Error: -c must be followed by an integer number.
de: Fehler: -c muss von einer Ganzzahl gefolgt werden.

source: Error: compression factor must lie in the interval [1,9].
de: Fehler: Der Kompressionsgrad muss im Intervall [1,9] liegen.

source: Error: -w must be followed by a floating point number.
de: Fehler: -w muss von einer Fließkommazahl gefolgt werden.

source: Error: Linewidth factor must lie in the interval [0.0,10.0].
de: Fehler: Der Strichstärken-Faktor muss im Intervall [0.0,10.0] liegen.

source: Error: --thin-alpha= must be followed by a floating point number.
de: Fehler: --thin-alpha= muss von einer Fließkommazahl gefolgt werden.

source: Error: Thin alpha must lie in the interval [0.01,10.0].
de: Fehler: Der Alpha-Wert für dünne Linien muss im Intervall [0,01,10,0] liegen.

source: Error: -r must be followed by <res> or <xres>x<yres>.
de: Fehler: -r muss von <res> oder <xres>x<yres> gefolgt werden.

source: Error: Resolutions must be at least 5 dpi.
de: Fehler: Auflösungen müssen mindestens 5 dpi betragen.

source: Error: -p must be followed by <sz> or <xsz>x<ysz>.
de: Fehler: -p muss von <sz> oder <xsz>x<ysz> gefolgt werden.

source: Error: Pixel sizes must be at least 20px.
de: Fehler: Die Pixelgröße muss mindestens 20px betragen.

source: Error: -s must be followed by a valid paper size.
de: Fehler: -s muss von einer gültigen Papiergröße gefolgt werden.

source: Error: The plot size must be at least 72 pt.
de: Fehler: Die Plotgröße muss mindestens 72pt betragen.

source: Error: --origin= must be followed by a valid pair of length specification.
de: Fehler: --origin= muss von einem Paar gültiger Längenangaben gefolgt werden.

source: Error: --paper= must be followed by a valid paper size.
de: Fehler: -paper= muss von einer gültigen Papiergröße gefolgt werden.

source: Error: The paper size must be at least 72 pt.
de: Fehler: Die Papiergröße muss mindestens 72pt betragen.

source: Error: --border= must be followed by a valid length.
de: Fehler: --border= muss von einer gültigen Längenangabe gefolgt werden.

source: Error: The page border must lie in the interval [0,144] pt.
de: Fehler: Der Seitenrand muss im Intervall [0,144] pt liegen.

source: Error: --angle= must be followed by a valid angle.
de: Fehler: --angle= muss von einem gültigen Winkel gefolgt werden.

source: Error: Number of plugin-args exceeds maximum of %d.
de: Fehler: Anzahl der Plugin-Argumente übersteigt das Maximum von %d.

source: Error: Number of plugin-args exceed maximum of %d.
de: Fehler: Anzahl der Plugin-Argumente übersteigt das Maximum von %d.

source: Error: Unknown option %s given.
de: Fehler: Unbekannte Kommandozeilenoption %s angegeben.

source: Error: No input file given.
de: Fehler: Keine Eingabedatei angegeben.

source: Error: Cannot create plotsize device.
de: Fehler: Die Plotgrößen-Ausgabeeinheit konnte nicht erzeugt werden.

source: Error: Cannot open input file %s: %s
de: Fehler beim Öffnen der Eingabedatei %s: %s

source: Error: Cannot create hpgl reader: %s
de: Fehler: Der HPGL-Leser konnte nicht erzeugt werden: %s

source: Error: Cannot determine plot size of file %s: %s
de: Fehler: Die Plotgröße der Datei %s konnte nicht bestimmt werden: %s

source: Error: Cannot determine plotsize: %s
de: Fehler beim Bestimmen der Plotgröße: %s

source: Error: Empty bounding: %g %g %g %g.
de: Fehler: leere Plotgröße: %g %g %g %g.

source: Error: Cannot open output file <%s>.
de: Fehler: Die Ausgabedatei <%s> konnte nicht geöffnet werden.

source: Error: Cannot create eps device.
de: Fehler: Der eps-Treiber konnte nicht instantiiert werden.

source: Error: Cannot create postscript device.
de: Fehler: Der PostScript-Treiber konnte nicht instantiiert werden.

source: Error: png device %s in not supported.
de: Fehler: Der PNG-Treiber kennt den Modus %s nicht.

source: Error: Cannot determine overall plotsize: %s
de: Fehler: Die Vereinigung aller Seitengrößen konnte nicht bestimmt werden: %s

source: Error creating %dx%dx%d sized png image: %s.
de: Fehler beim Erzeugen eines PNG-Pixelbilds der Größe %dx%dx%d: %s.

source: Error: Cannot create paint device.
de: Fehler: Der PNG-Treiber konnte nicht instantiiert werden.

source: Error: Cannot create plugin device: %s
de: Fehler beim Instantiieren eines Plugins: %s

source: Error: invalid plot device name %s specified.
de: Fehler: ungültiger Treibername %s angegeben.

source: Error: Cannot set png_dump filename to reader: %s
de: Fehler beim Setzen des Dateinamens der PNG Dump-Datei: %s

source: Error: Cannot stamp plot: %s
de: Fehler beim Erzeugen des Wasserzeichens: %s

source: Error: Cannot imbue plot device to reader: %s
de: Fehler beim Setzen des Treibers: %s

source: Error: Cannot process plot file %s: %s
de: Fehler beim Verarbeiten der Plot-Datei %s: %s

source: Success.
de: Erfolg.
