Repository: OS2World/APP-GRAPHICS-HPGS
Catalog: src/po/hpgs_*.po
Languages: de

source: (no error)
de: (kein Fehler)

source: Out of memory reading font directory %s.
de: Speicherüberlauf beim Lesen des Font-Verzeichnisses %s.

source: Cannot open font directory %s.
de: Das Font-Verzeichnis %s konnte nicht geöffnet werden.

source: Out of memory scanning font directories.
de: Speicherüberlauf beim Untersuchen der Font-Verzeichnisse.

source: Out of memory allocating font structure for font %s.
de: Speicherüberlauf beim Erzeugen der Font-Struktur für den Font %s.

source: Cannot open font %s in file %s.
de: Der Font %s in Datei %s konnte nicht geöffnet werden.

source: Error reading header of font %s.
de: Fehler beim Lesen des Headers des Fonts %s.

source: Error reading table %s of font %s.
de: Fehler Lesen der Tabelle %s des Fonts %s.

source: Cannot find font %s.
de: Der Font %s konnte nicht gefunden werden.

source: Error reading glyph number %d from file.
de: Fehler beim Lesen des Glyphs mit der Nummer %d.

source: Out of memory expanding page size stack.
de: Speicherüberlauf beim Vergrößern des Stapels für Papiergrößen

source: Error opening file %s: %s
de: Fehler beim Öffnen der Datei %s: %s

source: Error writing header of file %s: %s
de: Fehler beim Schreiben des Headers der Datei %s: %s

source: Error moving file %s to %.*s%4.4d%s.eps: %s
de: Fehler beim Umbenennen der Datei %s in %.*s%4.4d%s.eps: %s

source: Error removing file %s: %s
de: Fehler beim Löschen der Datei %s: %s

source: Error getting page stream data
de: Fehler beim Holen der Daten der Seitenbeschreibung

source: Error writing file %s: %s
de: Fehler beim Schreiben der Datei %s: %s

source: Maximum clip depth %d exceeded.
de: Maximale Anzahl %d der Clip-Ebenen überschritten.

source: hpgs_new_plugin_device: too much plugins registered (max %u).
de: hpgs_new_plugin_device: Es wurden zu viele Plugins registriert (max %u).

source: hpgs_new_plugin_device: unable to open plugin %s.
de: hpgs_new_plugin_device: Fehler beim Öffnen des Plugins %s.

source: hpgs_new_plugin_device: unable to open plugin %s: %s.
de: hpgs_new_plugin_device: Fehler beim Öffnen des Plugins %s: %s.

source: hpgs_new_plugin_device: unable to resolve function hpgs_plugin_version.
de: hpgs_new_plugin_device: Die Funktion hpgs_plugin_version konnte nicht im Plugin gefunden werden.

source: hpgs_new_plugin_device: unable to resolve function hpgs_plugin_version: %s.
de: hpgs_new_plugin_device: Die Funktion hpgs_plugin_version konnte nicht im Plugin gefunden werden: %s.

source: hpgs_new_plugin_device: Plugin version %d.%d does not match application version %d.%d.
de: hpgs_new_plugin_device: Die Version %d.%d des Plugins stimmt nicht mit der Version %d.%d der Applikation überein.

source: hpgs_new_plugin_device: unable to resolve function hpgs_plugin_new_device.
de: hpgs_new_plugin_device: Die Funktion hpgs_plugin_new_device konnte nicht im Plugin gefunden werden.

source: hpgs_new_plugin_device: unable to resolve function hpgs_plugin_new_device: %s.
de: hpgs_new_plugin_device: Die Funktion hpgs_plugin_new_device konnte nicht im Plugin gefunden werden: %s.

source: EOF during recovery from malformed HPGL command at file position %lu.
de: Ende der Datei beim Erholen von einem ungültigen HPGL-Kommando an der Dateiposition %lu.

source: No semicolon in the next 256 bytes during recovery from malformed HPGL command at file position %lu.
de: Kein Strichpunkt in den nächsten 256 Bytes beim Erholen von einem ungültigen HPGL-Kommando an der Dateiposition %lu.

source: Unexpected EOF after BEGMF;.
de: Unerwartetes Dateiende nach BEGMF;.

source: I/O Error rewinding input stream.
de: E/A Fehler beim Zurücksetzen der Eingabedatei.

source: Unexpected EOF after *OceJobBegin.
de: Unerwartetes Dateiende nach *OceJobBegin.

source: Invalid *-command after *OceJobData.
de: Unerwartetes *-Kommando nach *OceJobData gefunden.

source: Unexpected EOF between commands.
de: Unerwartetes Dateiende zwischen zwei HPGL-Kommandos.

source: Unknown command %c%c found at file position %lu.
de: Unbekanntes HPGL-Kommando %c%c an der Dateiposition %lu gefunden.

source: Trailing garbage in command %c%c at file position %lu.
de: Nichtinterpretierbare Daten am Ende des HPGL-Kommandos %c%c an der Dateiposition %lu.

source: command %c%c
de: HPGL-Kommando %c%c

source: PCL command
de: PCL-Kommando

source: The HPGL interpreter has been interrupted in %s at file position %lu.
de: Der HPGL-Interpreter wurde im %s an der Dateiposition %lu zum Abbruch gezwungen.

source: Read error in %s at file position %lu.
de: Lesefehler im %s an der Dateiposition %lu.

source: Error in %s at file position %lu.
de: Fehler im %s an der Dateiposition %lu

source: Unexpected EOF in %s at file position %lu.
de: Unerwartetes Dateiende im %s an der Dateiposition %lu.

source: Syntax error in %s at position %lu.
de: Syntaxfehler im %s an der Dateiposition %lu.

source: Error allocating memory for png dump filename: %s
de: Fehler bei der Allokation der Speichers für den Dateinamen der PNG Dump-Datei: %s

source: LB: Ignoring unknown control character <%d>.
de: LB: Unbekanntes Steuerzeichen <%d> ignoriert.

source: Message <%.*s>.
de: HPGL-Meldung <%.*s>.

source: Out of memory growing pen width array.
de: Speicherüberlauf beim Vergrößern des Stiftbreiten-Liste.

source: Out of memory growing pen color array.
de: Speicherüberlauf beim Vergrößern des Stiftfarben-Liste.

source: Illegal pen numer %d.
de: Ungültige Stiftnummer %d.

source: Illegal pen number %d replaced by %d.
de: Die ungültige Stiftnummer %d wurde durch %d ersetzt.

source: PC: Illegal pen number %d.
de: PC: Ungültige Stiftnummer %d.

source: LT: Illegal linetype %d.
de: LT: Ungültigen Linientyp %d.

source: PW: Illegal pen number %d.
de: PW: Ungültige Stiftnummer %d.

source: Cannot grow palette stack.
de: Fehler beim Erweitern des Paletten-Stacks.

source: Growing palette stack size to %lu.
de: Der Paletten-Stack wurde auf %lu Elemente vergrößert.

source: Out of memory pushing PCL palette.
de: Speicherüberlauf beim Erzeugen einer neuen PCL-Palette.

source: PCL palette stack underflow.
de: Es wurden mehr PCL-Paletten gelöscht als erzeugt wurden.

source: Plot Title: %.*s
de: Titel des Plots: %.*s

source: Comment: %.*s
de: Kommentar: %.*s

source: Bounding Box of Page %d: %g %g %g %g.
de: Bounding Box der Seite %d: %g %g %g %g.

source: Illegal linetype %d given.
de: Ungültiger Linientyp %d.

source: Empty x range.
de: Der angegebene Kooridnatenbreich in x-Richtung ist leer.

source: Empty y range.
de: Der angegebene Kooridnatenbreich in y-Richtung ist leer.

source: out of memory in push_poly_point.
de: Speicherüberlauf in push_poly_point.

source: Missing moveto in do_polygon.
de: Fehlendes move_to in do_polygon.

source: curveto error in do_polygon.
de: Fehler bei curveto in do_polygon.

source: internal error in do_polygon.
de: Interner Fehler in do_polygon.

source: PM: Illegal mode %d.
de: PM: Ungültige Modus %d.

source: unable to allocate %d bytes of temporary string data.
de: Speicherüberlauf beim Allokieren von %d bytes für temporäre Strings.

source: unable to convert string to encoding %s: %s.
de: Der String konnte nicht in die Kodierung %s umgewandelt werden: %s.

source: unable to open encoding %s.
de: Die Kodierung %s konnte nicht geöffnet werden.

source: moveto error.
de: Fehler bei moveto.

source: lineto error.
de: Fehler bei lineto.

source: curveto error.
de: Fehler bei curveto.

source: closepath error.
de: Fehler bei closepath.

source: Out of memory cutting thin line.
de: Speicherüberlauf bei der Scanline-Segmentierung einer dünnen Linie.

source: stroke: Image error
de: Pixelbild-Fehler in stroke

source: stroke: Error emitting scanlines.
de: Fehler bei der Ausgabe der Scanline-Segmente in stroke.

source: Out of memory creating stroke path.
de: Speicherüberlauf beim Erzeugen des Umrisses in stroke.

source: Error filling stroke path.
de: Fehler beim Füllen des Umrisses in stroke.

source: Maximum clip depth of %d exceeded.
de: Die maximale Clip-Tiefe %d wurde überschritten.

source: cliprestore: No valid clipper found.
de: Kein gültiger clipper in cliprestore.

source: setdash: Out of memory.
de: Speicherüberlauf in setdash.

source: setrop3: Invalid ROP3 %d specified
de: Ungültige ROP3-Operation %d in setrop3.

source: drawimage: Null image specified.
de: Kein Bild in drawimage angegeben.

source: drawimage error
de: Fehler in drawimage

source: drawimage error.
de: Fehler in drawimage.

source: setplotsize: The given bounding box result in a null image.
de: setplotsize: Die angegebene Bounding Box resultiert in einem leerem Bild.

source: setplotsize: error resizing image
de: setplotsize: Fehler beim Umdimensionieren des Pixelbildes

source: setplotsize: Out of memory allocating path clipper.
de: setplotsize: Speicherüberlauf beim Allokieren des Scanline-Trägers.

source: setplotsize: Out of memory allocating clip clipper.
de: setplotsize: Speicherüberlauf beim Allokieren des Clip-Trägers.

source: setplotsize: Out of memory initializing clip clipper.
de: setplotsize: Speicherüberlauf beim Initialisieren des Clip-Trägers.

source: fill: Error cutting current path.
de: fill: Fehler bei der Scanline-Segmentierung der aktuellen Pfades.

source: fill: Image error
de: fill: Pixelbild-Fehler

source: fill: Error emitting scanlines.
de: fill: Fehler bei der Ausgabe der Scanline-Segmente.

source: clip: Error cutting current path.
de: clip: Fehler bei der Scanline-Segmentierung der aktuellen Pfades.

source: clip: Out of memory creating new clipper.
de: clip: Speicherübelauf beim Erzeugen eines neuen Clip-Trägers.

source: libpng warning: %s.
de: Warnung der Bibliothek libpng: %s.

source: Error opening file %s for writing: %s.
de: Fehler beim Öffnen der Datei %s zum Schreiben: %s.

source: libpng error creating write structure for file %s.
de: Fehler der Bibliothek libpng beim Erzeugen der write-Struktur für die Datei %s.

source: libpng error creating info structure for file %s.
de: Fehler der Bibliothek libpng beim Erzeugen der info-Struktur für die Datei %s.

source: libpng error writing file %s
de: Fehler der Bibliothek libpng beim Schreiben der Datei %s

source: Invalid PNG compression %d specified.
de: Die ungültige PNG-Kompression %d wurde angegeben.

source: Exposure of image data is not implemented.
de: Der Zugriff auf die rohen Bilddaten ist nicht unterstützt.

source: Image resize is not implemented.
de: Redimensionierung des Pixelbildes ist nicht unterstützt.

source: Image clear is not implemented.
de: Löschen des Inhaltes des Pixelbildes ist nicht unterstützt.

source: Image write is not implemented.
de: Schreiben der Pixelbild-Datei ist nicht unterstützt.

source: Number of indexed colors exceeds 256.
de: Die Anzahl der indizierten Farben hat 256 überschritten.

source: Try to set a palette to a non-indexed image.
de: Es wurde versucht, einem nicht-indizierten Pixelbild eine Palette aufzuprägen.

source: Invalid number %d of palette colors.
de: Ungültige Palettengröße %d.

source: hpgs_image_rop3_clip: Out of memory growing temporary storage.
de: hpgs_image_rop3_clip: Speicherüberlauf beim Vergrößern der temporären Datenstrukturen.

source: hpgs_image_rop3_clip: Out of memory allocating temporary storage.
de: hpgs_image_rop3_clip: Speicherüberlauf beim Anlegen der temporären Datenstrukturen.

source: Estimated PCL src width = %d.
de: Geschätze PCL Quell-Breite = %d.

source: Estimated PCL src height = %d.
de: Geschätze PCL Quell-Höhe = %d.

source: Incompatible CID encoding %d for compression mode 10.
de: Inkompatible CID-Kodierung %d für den Kompressionmodus 10.

source: Out of memory allocating %d bytes of raster bata buffer.
de: Speicherüberlauf beim Allokieren von %d bytes für temporäre Rasterdaten.

source: No PCL source raster width specified.
de: Keine PCL Quell-Breite angegeben.

source: No PCL source raster height specified.
de: Keine PCL Quell-Höhe angegeben.

source: Creating %dx%d PCL image.
de: Erzeuge %dx%d PCL-Pixelbild.

source: Invalid PCL Pixel Encoding Mode %d.
de: Ungültige PCL-Pixelcodierung %d.

source: Out of memory creating PCL image.
de: Speicherüberlauf beim Anlegen des PCL-Pixelbildes.

source: PCL raster line %d is out of range (%dx%d).
de: Die PCL Rasterlinie %d ist außerhalb des gültigen Bereichs (%dx%d).

source: No raster data.
de: Keine Rasterdaten vorhanden.

source: Invalid bpi %d.
de: Ungültige bpi (Bits pro Pixel) %d.

source: Error downsizing PCL image.
de: Fehler beim Verkleinern des PCL-Rasterbildes.

source: Dumping inline PCL image to file <%s>.
de: Das PCL-Pixelbild wird als Datei <%s> exportiert.

source: PCL command %c%c%d%c found.
de: Das PCL-Kommando %c%c%d%c wurde gefunden.

source: Warning: Invalid pattern %d specified setting pattern to 50%% grey.
de: Warnung: Ungültiges Muster %d; 50%% Grau wird als Muster verwendet.

source: PCL push/pop palette arg %d invalid.
de: Das Argument %d für den PCL-Befehl push/pop palette ist ungültig.

source: PCL CID command after image data.
de: Das PCL CID-Kommando wurde nach den Bilddaten gefunden.

source: PCL CID command with arg==18 and non-trivial colorspace is unimplemented.
de: Das PCL CID-Kommando mit 18 Argumenten und nicht-trivialen Frbraum ist nicht implementiert.

source: PCL CID command with arg!=6 and arg !=18 is unimplemented.
de: Das PCL CID-Kommando ist nur mit 6 Argumenten oder 18 Argumenten implementiert.

source: Invalid bits per index %d for PCL CID encoding 0.
de: Ungültige bits pro index %d für die PCL CID-Kodierung 0.

source: Inavlid bits per index %d for PCL CID encoding 1.
de: Ungültige bits pro index %d für die PCL CID-Kodierung 1.

source: PCL Color index %d is out of bounds.
de: Der PCL-Farbindex %d ist außerhalb des gültigen Bereichs.

source: PCL Raster Presentation Mode %d is invalid.
de: Der PCL Raster-Präsentations-Modus %d ist ungültig.

source: PCL Raster Resolution %d is out of bounds.
de: Die PCL-Raster-Auflösung %d ist außerhalb des gültigen Bereichs.

source: PCL Source raster width command after image data.
de: Die PCL Quell-Breite wurde nach den Bilddaten gefunden.

source: PCL Source raster width %d is out of bounds.
de: Die PCL Quell-Breite %d ist außerhalb es gültigen Bereichs.

source: PCL Source raster height command after image data.
de: Die PCL Quell-Höhe wurde nach den Bilddaten gefunden.

source: PCL Source raster height %d is out of bounds.
de: Die PCL Quell-Höhe %d ist außerhalb es gültigen Bereichs.

source: Warning: PCL Destination raster width %d is out of range and will be clamped to 65535.
de: Warnung: Die PCL Ziel-Breite %d ist außerhalb es gültigen Bereichs und wird auf 65535 beschränkt.

source: PCL Destination raster width %d is out of bounds.
de: Die PCL Ziel-Breite %d ist außerhalb es gültigen Bereichs.

source: Warning: PCL Destination raster height %d is out of range and will be clamped to 65535.
de: Warnung: Die PCL Ziel-Höhe %d ist außerhalb es gültigen Bereichs wird auf 65535 beschränkt.

source: PCL Destination raster height %d is out of bounds.
de: Die PCL Ziel-Höhe %d ist außerhalb es gültigen Bereichs.

source: Warning: Ignoring image data in PCL Raster Compression Mode %d.
de: Warnung: PCL Rasterdaten im Kompressionsmodus %d werden ignoriert.

source: PCL Raster Row length %d is invalid.
de: Die PCL Rasterzeilen-Länge %d ist ungültig.

source: Raster compression mode 4 data block among other raster data is unsupported.
de: Komprimierte Rasterdaten im Modus 4 in der Mitte anderer Rasterdaten sind nicht unterstützt.

source: Unknown PCL command %c%c%d%c found.
de: Das ungültige PCL-Kommando %c%c%d%c wurde gefunden.

source: Setting PJL papersize %dx%d.
de: Die PJL-Papiergröße %dx%d wurde übernommen.

source: Illegal line heading <%s> in PJL.
de: Ungültiger Zeilenanfang <%s> im PJL-Kontext.

source: Missing number in PJL SET PAPERLENGTH.
de: Keine Zahl nach PJL SET PAPERLENGTH.

source: Missing number in PJL SET PAPERWIDTH.
de: Keine Zahl nach PJL SET PAPERWIDTH.

source: Missing number in PJL SET RESOLUTION.
de: Keine Zahl nach PJL SET RESOLUTION.

source: Setting PJL papersize %dx%d
de: Die PJL-Papiergröße %dx%d wurde übernommen.

source: Invalid language <%s> in PJL ENTER LANGUAGE.
de: Ungültige Plottersprache <%s> nach PJL ENTER LANGUAGE.

source: Cannot get file position in PJL interpretation.
de: Bei der PJL-Interpretation konnte die Dateiposition nicht bestimmt werden.

source: hpgs v%s - HPGl Script, a hpgl/2 interpreter/renderer. (C) 2004-2009 ev-i Informationstechnologie GmbH (http://www.ev-i.at) published under the LGPL (http://www.fsf.org/licenses/lgpl.html). Type `hpgs --help' for a detailed description of cmd line options.
de: hpgs v%s - HPGl Script, ein hpgl/2 Interpreter/Renderer. (C) 2004-2009 ev-i Informationstechnologie GmbH (http://www.ev-i.at) veröffentlicht unter der LGPL (http://www.fsf.org/licenses/lgpl.html). Tippen Sie `hpgs --help' um eine detaillierte Beschreibung der Kommandozeilenparameter zu erhalten.
